# 인간-컴퓨터 상호작용 https://www.acmicpc.net/problem/16139

'''
주어지는 문자열에서 특정 구간에 특정 알파벳이 몇개나온는 지를 찾기
seungjaehwang => 정리를 잘 해놓기
1) 구간 start~end까지
2) 각 구간별 알파벳 갯수

'''


import sys
input = sys.stdin.readline 

s = input().strip()
#   s e u n g j a e h w a  n  g
#   0 1 2 3 4 5 6 7 8 9 10 11 12
# a 0 0 0 0 0 0 1 1 1 1 2  2  2  
# b 0 0 0 0 0 0 0 0 00 0 0 0 0
# c 0 0 0 0 0 0 00 00 00
# d 0 0 0 0 0 0 0
# e
# s 1 1 1 1 1 1 1 1 1 1 1 1 1 1
# z

# 딕셔너리 26*len(문자)의 리스트가 필요하고 
# <아스키코드> 
# ord('a') 문자 => 숫자
# chr(65)  숫자 => 문자로 변경 
d = {chr(ord('a')+i) : [0]*len(s) for i in range(26)}
# {'a': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
#  'b': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
#  'c': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
#  'd': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
#  'e': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
#  'f': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'g': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'h':                                                                 [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'i': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'j': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'k': [0, 0, 0, 0, 0, 0, 0, 0, 0                                                               0, 0, 0, 0, 0], 'l': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'm': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'n': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'o': [0, 0,                                                               , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'p': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'q': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'r': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0                                                               0, 0, 0], 's': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 't': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'u': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'v': [0, 0, 0, 0,                                                               , 0, 0, 0, 0, 0, 0, 0, 0, 0], 'w': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'x': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'y': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0                                                               0], 'z': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}


for i in range(len(s)):
    print(s[i],i,'----')
    # (1) 딕셔너리에서 s[i]의 value를 찾으세요.
    lst = d[s[i]]
    # (2) i부터 ~ 끝까지 1씩 더해....
    for j in range(len(s)-i):
        lst[i+j] += 1
    
print(d)

q = int(input())

for i in range(q):
    a, l, r = list(input().split())
    l, r = int(l), int(r)
    print(a,l,r,"---")
    # 스타트가 맨앞 시작 5번
    # 중간스타트 끝 - 스타트 전
    if l == 0:
        print(d[a][r])
    else:
        print(d[a][r] - d[a][l-1])
    











# for i in range(q):
#     a, l, r = list(input().split())
#     l, r = int(l), int(r)+1
#     # print(a,l,r)
#     # print((s[l:r]))
#     ss = s[l:r]
#     sum = 0
#     for j in range(r-l):
#         if ss[j] == a:
#             sum += 1
#     print(sum)




